# RailingSystemFamilySegmentPattern Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..RailingSystemFamilySegmentPattern Property
GroupTypeId Class See Also
---
Segment Pattern (default).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId RailingSystemFamilySegmentPattern { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailingSystemFamilySegmentPattern As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RailingSystemFamilySegmentPattern {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace